<?php

namespace Modules\Store;

class Code
{
    public static $table = [
        0     => 'ok',
        10001 => 'code 不正确',

        20001 => '手机号格式错误',
        20002 => '手机号未注册',
        20003 => '登录密码错误',
        20004 => '手机号已注册',
        20005 => '注册失败',
        20006 => '注册成功',
        20007 => '验证码已发送',
        20008 => '更新成功',

        20101 => '优惠券发布失败',
        20102 => '优惠券发布成功',

        20201 => '商品编辑成功',
        20202 => '商品编辑失败',
        20203 => '商品删除成功',
        20204 => '商品删除失败',
        20205 => '商品不存在',
        20206 => '商品名称已存在',

        20301 => '员工信息不存在',
        20302 => '手机号已被占用',
        20303 => '员工编辑成功',
        20304 => '员工删除成功',
        20305 => '员工删除失败',
    ];
}