<?php

namespace Modules\Store;

class Code
{
    public static $table = [
        0     => 'ok',
        10001 => 'code 不正确',
        10002 => '禁止操作',
        10101 => '请重新登录',

        20001 => '手机号格式错误',
        20002 => '手机号未注册',
        20003 => '登录密码错误',
        20004 => '手机号已注册',
        20005 => '注册失败',
        20006 => '注册成功',
        20007 => '验证码已发送',
        20008 => '更新成功',

        20101 => '优惠券发布失败',
        20102 => '优惠券发布成功',

        20201 => '商品编辑成功',
        20202 => '商品编辑失败',
        20203 => '商品删除成功',
        20204 => '商品删除失败',
        20205 => '商品不存在',
        20206 => '商品名称已存在',

        20301 => '员工信息不存在',
        20302 => '手机号已被占用',
        20303 => '员工编辑成功',
        20304 => '员工删除成功',
        20305 => '员工删除失败',

        20401 => '用户不存在，请先关注万物生活小程序',
        20402 => '优惠券不存在',
        20403 => '优惠券已过期',
        20404 => '该优惠券针对于用户发送已达上限',
        20405 => '该优惠券已发送完毕',
        20406 => '充值成功',
        20407 => '充值失败',
        20408 => '此券禁止充值',

        20501 => '优惠码不存在',
        20502 => '优惠码次数不足',
        20503 => '优惠码已过期',
        20504 => '储值码请输入核销金额',
        20505 => '余额不足',
        20506 => '次卡券已使用完毕',
        20507 => '优惠码存在',
        20508 => '核销失败',
        20509 => '核销成功',

        30001 => '图片丢失',
        30002 => '图片上传成功',
    ];
}